{"pageProps":{"postData":{"id":"the-linux-ego","contentHtml":"<h1>Background</h1>\n<p>I remember that my software journey started when I started to read the book <a href=\"https://www.oreilly.com/library/view/head-first-c/9781449335649/\">Head First C</a>.\nI read the book because I wanted to learn programming and C language.\nBy starting with C, I fell in love with it, and it's still my most favorite language until now.\nHowever, there is another one I unexpectedly fell in love with - the Linux operating system.\nIn my mind, Linux is the best software ever created, it's lightweight, fast, open-source, and can be installed in any kind of hardware.</p>\n<p>From the first version in 1991, it took less than 30 years to become the most important software in the world.\nFrom the little embedded board to the smartphone in our hand, or to a supper computer, we see Linux everywhere.\nI personally use Linux on my computer all-time, from working to playing some games.\nBut we must admit that Linux has failed to be popular on personal computers.</p>\n<h1>Built for developers from the beginning</h1>\n<p>The best part about Linux is its stable, efficient, and especially easy to do stuff with commands.\nYou can easy to create a file with the <code>touch</code> command, write text to files with the <code>cat</code> command,\nor simply build a program with the <code>gcc</code> command.\nBut we all know that these things are easy for our developer culture only, it's not the way to use computers for users at all.\nHow do we expect people to copy files using the <code>cp</code> command or edit files using Vim?</p>\n<p>The creator of Linux - Linus Torvald was a great developer by making Linux.\nBut he said before that he can do anything with computer memory, CPU kinds of stuff, but he will die if we force him to design an interface.\nFrom the beginning, Linux was created by a developer and was built for developers.</p>\n<p>To bring Linux to the world, we need friendly interfaces, software managers, etc. That is where Linux distributions came from.</p>\n<h1>The distributions family</h1>\n<p>A Linux distribution is a combination of the Linux kernel (created by Linus Torvald),\na friendly user interface (we call them Linux desktop environment), a packages manager, and installed software.\nLet's look at Ubuntu. It has the Linux kernel, a desktop environment names Unity, a packages manager name apt,\nand some installed software like a web browser, a file manager, etc.\nNow we call Ubuntu a complete operating system for any user, it can be compared to Window or MacOS as well.</p>\n<p>Almost Linux distributions were open-source at the beginning, it was a very great idea and contribution to the world of software, but it also was the beginning of problems.\nMany developers don't like the orange color and Unity's interface, and because Ubuntu is open-source, they easy to make other distributions.\nSome people like the green colors and the Window old-style interface, so they created Linux Mint.\nOther people like an elegant interface and look like MacOS, so they create the Elementary OS.\nIn the hacking culture, hackers need so many tools and software, so they just create a new distribution names Kali Linux with many hacking tools installed.</p>\n<p>In this way, the world of Linux distribution is out of control, and it becomes too large today.\nYou can look at <a href=\"https://distrowatch.com/images/other/distro-family-tree.png\">this image</a> and see that there are thousands of Linux distributions are existing.\nDo we need so many distributions at present? I think we don't! It split up our developer resources.\nWhy do we need to create a new distribution just because we need some pre-installed tools or the green color instead of the orange?</p>\n<h1>We need to let go of our egos</h1>\n<p>As a developer for years, I also make so many changes and designs for Linux distribution on my computers.\nWhy do we need to accept ideas that came from others while we can make our one?\nI think there are many developers who have the same question as me.\nI also ask myself why we can work together on a single Linux kernel idea, but can not work together on a single distribution.</p>\n<p>The simple answer that I have at present, a Linux kernel is too large or there is nothing for a person or a group of people to change or personalize, we all need the kernel works well.\nBut a Linux distribution that includes software and interfaces is too personal. That is where our developer ego rises.</p>\n<p>Have we ever thought what if we can work together on a Linux distribution or some of it, not thousands at present?\nIt will be great, and we will rule the world the same as the way Linux kernel is doing.</p>\n<h1>Many thanks to</h1>\n<ul>\n<li><a href=\"https://github.com/torvalds\">Linus Torvald</a> for creating Linux and making it open-source.</li>\n<li><a href=\"https://distrowatch.com/dwres.php?resource=family-tree\">Distrowatch</a> for catching up and sharing about all Linux distributions.</li>\n<li>Developers around the world for making a great Linux community and culture.</li>\n</ul>","title":"The Linux Ego 🐧","description":"Linux is the most popular operating system in servers and embedded systems. But why was not it popular in the personal computer sector?","author":"Eden","date":"Sep 6th, 2020","tag":"Writing"}},"__N_SSG":true}